{
    "2025-12-22": "First run of my training for my first 50km race. Very excited for the training that is ahead as I become the best mental and physical version of myself. ",
    "2026-01-05": "Tried to run for 30 minutes but only did 22 because it is my first run of the campaign. Miles felt good. Got to start drinking more water and electrolytes in order for my muscles to be in great condition to run again. Looking forward to the journey ahead!",
    "2026-01-07": "Ran to a restaurant where I hung out with Price and Maya. Run felt really good just running down Milwaukee avenue.",
    "2026-01-09": "Did a full body workout and decided to get a little run in afterwards. ",
    "2026-01-14": "Very short run to meet my mom at a Breakfast spot near our Airbnb in Mexico City. Ran through a very pretty park in Condesa. First run at 1.5 miles elevation.",
    "2026-01-15": "5mile hike. Was my first ever hike at 3800 meters altitude and I definitely felt it. Met some cool people from all over and made me realize when I meet new people from different places I should TALK TALK TALK.",
    "2026-01-18": "Very short run. This was my final run in Mexico City. I was trying to run two miles but my lungs were feeling heavy because of the altitude. I ran through the really pretty park in Condesa. The running community at this park is rally inspiring as well which makes me really excited for when I return. I think the next time I am in Mexico City will be when I come for a week and work remote and go for runs in the morning and evening. ",
    "2026-01-21": "First official day of training where I will be super consistent in the coming weeks. I did a really good full body workout where I hit my legs especially hard. Squatted 175 pounds so that is the starting benchmark of my legs training. Ended the workout with a very chill mile run on the treadmill.",
    "2026-01-24": "Wanted to run for 30 minutes nonstop at a easy pace to get more mileage down for training.",
    "2026-01-25": "Ran to Miles and Keitlin's apartment to watch the Arsenal vs Manchester United Match. It was snowy so I ran very slowly to make sure I did not get hurt. ",
    "2026-01-27": "Ran for 30 minutes on the depaul track at a very easy pace. Turned out to be 3 miles and they felt really good.",
    "2026-01-28": "Hit legs and did a one mile run on the track. Really trying to incorporate movement in my legs strength training becuase I feel much stronger."
}